duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/lcd/lcd.c
	return false;
}

void LCD_ShowUniStringInRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t *p)
{
	int16_t str_x=x,str_y=y,str_w,str_h;
	uint16_t *pre,*next,show;
	uint8_t w=0;
	uint16_t end=0x000a,space=0x0020;
	font_arabic_forms arab_al_froms = {0x00};

	if(g_language_r2l)
	{
		str_w = 0;
		if(x > width)
			str_w = x-width;
	}
	else
	{
		str_w = x+width;
		if(str_w >= LCD_WIDTH)
			str_w = LCD_WIDTH;
	}
	str_h = y+height;

	pre = NULL;
	next = p+1;
	while(*p)
	{       
		if(g_language_r2l)
		{
			if(*p==end){str_x=x;str_y+=system_font;p++;}
			if(str_y>=str_h)break;//退出
			if(*p==0x0000)break;//退出
			show = *p;

			if(global_settings.language == LANGUAGE_AR)
			{
				uint8_t flag = 0;//0b00000000:isolated; 0b00000001:initial; 0b00000011:medial; 0b00000010:final
				
				if((pre != NULL)&&(*pre != space))
					flag |= 0b00000010;
				if((*next != 0x0000)&&(*next != space))
					flag |= 0b00000001;

				if(flag != 0)
				{
					LCD_FindArabAlphabetFrom(*p, &arab_al_froms);
					switch(flag)
					{
					case 1:
						show = arab_al_froms.initial;
						break;
					case 2:
						show = arab_al_froms.final;
						break;
					case 3:
						show = arab_al_froms.medial;
						break;
					}
				}
			}
						
			w = LCD_Measure_Uni_Byte(show);
			if((str_x-w)<=str_w){str_x=x-w;str_y+=system_font;}
			if(str_y>=str_h)break;//退出
			str_x -= w;
			LCD_Show_Uni_Char_from_flash(str_x,str_y,show,0);
		}
		else
		{
			if(*p==end){str_x=x;str_y+=system_font;p++;}
			if(str_y>=str_h)break;//退出
			if(*p==0x0000)break;//退出
			w = LCD_Measure_Uni_Byte(*p);
			if((str_x+w)>=str_w){str_x=x;str_y+=system_font;}
			if(str_y>=str_h)break;//退出
			LCD_Show_Uni_Char_from_flash(str_x,str_y,*p,0);
			str_x += w;
		}
		
		pre = p;
		p++;
		next = p+1;
	}
}

//显示中英文字符串
//x,y:起点坐标
//*p:字符串起始地址	
void LCD_ShowUniString(uint16_t x, uint16_t y, uint16_t *p)
{
	int16_t str_x=x,str_y=y;
	uint16_t *pre,*next,show;
	uint16_t space=0x0020;
	uint8_t w=0;
	uint8_t width;
	font_arabic_forms arab_al_froms = {0x00};

	if((str_x >= LCD_WIDTH)||(str_y >= LCD_HEIGHT))
		return;

	pre = NULL;
	next = p+1;
	while(*p)
	{
		if(g_language_r2l)
		{
			if(str_x<=0)break;//退出

			show = *p;
			if(global_settings.language == LANGUAGE_AR)
			{
				uint8_t flag = 0;//0x00000000:isolated; 0b00000001:initial; 0b00000011:medial; 0b00000010:final
				
				if((pre != NULL)&&(*pre != space))
					flag |= 0b00000010;
				if((*next != 0x0000)&&(*next != space))
					flag |= 0b00000001;

				if(flag != 0)
				{
					LCD_FindArabAlphabetFrom(*p, &arab_al_froms);
					switch(flag)
					{
					case 1:
						show = arab_al_froms.initial;
						break;
					case 2:
						show = arab_al_froms.final;
						break;
					case 3:
						show = arab_al_froms.medial;
						break;
					}
				}
			}
			w = LCD_Measure_Uni_Byte(show);
			if(str_x<=w)break;//退出
			str_x -= w;
			LCD_Show_Uni_Char_from_flash(str_x,str_y,show,0);
		}
		else
		{
			if(str_x>=LCD_WIDTH)break;//退出
			width = LCD_Show_Uni_Char_from_flash(str_x,str_y,*p,0);
			str_x += width;
		}

		pre = p;
		p++;
		next = p+1;
	}
}
#endif/*FONTMAKER_UNICODE_FONT*/

#if 0
//m^n函数
//返回值:m^n次方.
uint32_t LCD_Pow(uint8_t m,uint8_t n)
{
	uint32_t result=1;	 
	while(n--)result*=m;    
	return result;
}

//显示数字,高位为0,则不显示
//x,y :起点坐标	 
//len :数字的位数
//color:颜色 
//num:数值(0~4294967295);	 
void LCD_ShowNum(uint16_t x,uint16_t y,uint32_t num,uint8_t len)
{         	
	uint8_t t,temp;
	uint8_t enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
			#ifdef IMG_FONT_FROM_FLASH
				LCD_ShowChar_from_flash(x+(system_font/2)*t,y,' ',0);
			#else
				LCD_ShowChar(x+(system_font/2)*t,y,' ',0);
			#endif
				continue;
			}
			else 
				enshow=1; 
		 	 
		}
	#ifdef IMG_FONT_FROM_FLASH
		LCD_ShowChar_from_flash(x+(system_font/2)*t,y,temp+'0',0);
	#else
	 	LCD_ShowChar(x+(system_font/2)*t,y,temp+'0',0); 
	#endif
	}
}

//显示数字,高位为0,还是显示
//x,y:起点坐标
//num:数值(0~999999999);	 
//len:长度(即要显示的位数)
//mode:
//[7]:0,不填充;1,填充0.
//[6:1]:保留
//[0]:0,非叠加显示;1,叠加显示.
void LCD_ShowxNum(uint16_t x,uint16_t y,uint32_t num,uint8_t len,uint8_t mode)
{  
	uint8_t t,temp;
	uint8_t enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				if(mode&0X80)
				{
				#ifdef IMG_FONT_FROM_FLASH
					LCD_ShowChar_from_flash(x+(system_font/2)*t,y,'0',mode&0X01);
				#else
					LCD_ShowChar(x+(system_font/2)*t,y,'0',mode&0X01);
				#endif
				}
				else 
				{
				#ifdef IMG_FONT_FROM_FLASH
					LCD_ShowChar_from_flash(x+(system_font/2)*t,y,' ',mode&0X01);
				#else
					LCD_ShowChar(x+(system_font/2)*t,y,' ',mode&0X01); 
				#endif
				}
				
 				continue;
			}
			else 
				enshow=1; 
		}
	#ifdef IMG_FONT_FROM_FLASH
		LCD_ShowChar_from_flash(x+(system_font/2)*t,y,temp+'0',mode&0X01);
	#else
	 	LCD_ShowChar(x+(system_font/2)*t,y,temp+'0',mode&0X01);
	#endif
	}
} 
#endif

//根据字体测量字符串的长度和高度
//p:字符串指针
//width,height:返回的字符串宽度和高度变量地址
void LCD_MeasureString(uint8_t *p, uint16_t *width,uint16_t *height)
{
	uint8_t font_size;

	*width = 0;
	*height = 0;

	if(p == NULL || strlen((const char *)p) == 0)
		return;

	(*height) = system_font;

	while(*p)
	{
		if(*p<0x80)
		{
		#ifdef FONTMAKER_UNICODE_FONT
			(*width) += LCD_Measure_Uni_Byte(*p);
		#elif defined(FONTMAKER_MBCS_FONT)
			(*width) += LCD_Measure_Mbcs_Byte(*p);
		#else
			(*width) += system_font/2;
		#endif
			p++;
		}
		else if(*(p+1))
		{
			(*width) += system_font;
			p += 2;
		}        
	}  
}

//恢复字体画笔默认颜色
void LCD_ReSetFontColor(void)
{
	POINT_COLOR = WHITE;
}

//设置字体画笔颜色
void LCD_SetFontColor(uint16_t color)
{
	POINT_COLOR = color;
}

//恢复字体背景默认颜色
void LCD_ReSetFontBgColor(void)
{
	BACK_COLOR = BLACK;
}

//设置字体背景颜色
void LCD_SetFontBgColor(uint16_t color)
{
	BACK_COLOR = color;
}

//设置系统字体
//font_size:枚举字体大小
void LCD_SetFontSize(uint8_t font_size)
{
	if(font_size > FONT_SIZE_MIN && font_size < FONT_SIZE_MAX)
		system_font = font_size;
}

void LCDMsgProcess(void)
{
	if(lcd_sleep_in)
	{
		lcd_sleep_in = false;

		if(LCD_Get_BL_Mode() != LCD_BL_ALWAYS_ON)
		{
			LCD_BL_Off();

			if((screen_id == SCREEN_ID_STEPS)
				||(screen_id == SCREEN_ID_SLEEP)
				)
			{
				EnterIdleScreen();
			}
			
			LCD_SleepIn();
		}
	}

	if(lcd_sleep_out)
	{
		lcd_sleep_out = false;
	
		LCD_SleepOut();
		
		if(IsInIdleScreen())
		{
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TIME|SCREEN_EVENT_UPDATE_DATE|SCREEN_EVENT_UPDATE_WEEK|SCREEN_EVENT_UPDATE_SIG|SCREEN_EVENT_UPDATE_NET_MODE|SCREEN_EVENT_UPDATE_BAT;
			IdleScreenProcess();
		}

		LCD_BL_On();
	}
}
